# EXERCISE 0

In [1]:
%load_ext sql

In [2]:
import getpass
user = 'root'
password = getpass.getpass()
#world ->dummydataset
connection_string = f'mysql+pymysql://{user}:{password}@127.0.0.1:3306/new_schema'
%sql $connection_string

········

'Connected: root@new_schema'

1. Genera 2 tablas basado en los alumnos de la clase, los cuales tengan los siguientes datos:

Tabla1->alumnos

- IdAlumno
- Nombre
- Apellido


Tabla 2->Calificaciones

- IdAlumno
- Materia
- Calificación

In [3]:
%%sql
CREATE TABLE IF NOT EXISTS alumnos(
IdAlumno INT, 
Nombre VARCHAR(20), 
Apellido VARCHAR(20)
);

CREATE TABLE IF NOT EXISTS calificaciones(
IdAlumno INT, 
Materia VARCHAR(20), 
Calificacion INT
);

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
0 rows affected.
0 rows affected.

[]

2. Inserta los datos correspondientes a los alumnos

In [4]:
%%sql
INSERT INTO alumnos(IdAlumno,Nombre,Apellido)
VALUES (7,"Monica","Hernandez"),
       (8,"Jose","Hernandez"),
       (9,"Carlos","Juarez"),
       (10,"Raul","Juarez"),
       (11,"Jairo","Lira");

INSERT INTO calificaciones(IdAlumno,Materia,Calificacion)
VALUES (7,"ML_Fundamentos",10),
       (8,"ML_Fundamentos",9),
       (9,"ML_Fundamentos",8),
       (10,"ML_Fundamentos",10),
       (11,"ML_Fundamentos",9),
        
       (7,"Etica",9),
       (8,"Etica",8),
       (9,"Etica",10),
       (10,"Etica",9),
       (11,"Etica",8),
       
       (7,"Sql",8),
       (8,"Sql",10),
       (9,"Sql",9),
       (10,"Sql",8),
       (11,"Sql",10);

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
5 rows affected.
15 rows affected.

[]

In [5]:
%%sql
SELECT *
FROM alumnos

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
5 rows affected.

[(7, 'Monica', 'Hernandez'),
 (8, 'Jose', 'Hernandez'),
 (9, 'Carlos', 'Juarez'),
 (10, 'Raul', 'Juarez'),
 (11, 'Jairo', 'Lira')]

In [6]:
%%sql
SELECT *
FROM calificaciones

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
30 rows affected.

[(7, 'ML_Fundamentos', 10),
 (8, 'ML_Fundamentos', 9),
 (9, 'ML_Fundamentos', 8),
 (10, 'ML_Fundamentos', 10),
 (11, 'ML_Fundamentos', 9),
 (7, 'Etica', 9),
 (8, 'Etica', 8),
 (9, 'Etica', 10),
 (10, 'Etica', 9),
 (11, 'Etica', 8),
 (7, 'Sql', 8),
 (8, 'Sql', 10),
 (9, 'Sql', 9),
 (10, 'Sql', 8),
 (11, 'Sql', 10),
 (7, 'ML_Fundamentos', 10),
 (8, 'ML_Fundamentos', 9),
 (9, 'ML_Fundamentos', 8),
 (10, 'ML_Fundamentos', 10),
 (11, 'ML_Fundamentos', 9),
 (7, 'Etica', 9),
 (8, 'Etica', 8),
 (9, 'Etica', 10),
 (10, 'Etica', 9),
 (11, 'Etica', 8),
 (7, 'Sql', 8),
 (8, 'Sql', 10),
 (9, 'Sql', 9),
 (10, 'Sql', 8),
 (11, 'Sql', 10)]

3. Agrega a la tabla una columna denominada perfil de especialización

In [7]:
%%sql
ALTER TABLE alumnos ADD (Especializacion VARCHAR(20))

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
0 rows affected.

[]

In [8]:
%%sql
SELECT *
FROM alumnos

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
5 rows affected.

[(7, 'Monica', 'Hernandez', None),
 (8, 'Jose', 'Hernandez', None),
 (9, 'Carlos', 'Juarez', None),
 (10, 'Raul', 'Juarez', None),
 (11, 'Jairo', 'Lira', None)]

4. Inserta los datos correspondientes a esa columna

In [9]:
%%sql
SELECT IdAlumno
FROM Calificaciones
WHERE Calificacion = 10 AND Materia = "ML_Fundamentos"

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
4 rows affected.

[(7,), (10,), (7,), (10,)]

In [10]:
%%sql
UPDATE alumnos
SET Especializacion="Esp_1" 
WHERE IdAlumno IN (SELECT IdAlumno
                   FROM Calificaciones
                   WHERE Calificacion = 10 AND Materia = "ML_Fundamentos");

UPDATE alumnos
SET Especializacion="Esp_2" 
WHERE IdAlumno IN (SELECT IdAlumno
                   FROM Calificaciones
                   WHERE Calificacion = 10 AND Materia = "Etica");

UPDATE alumnos
SET Especializacion="Esp_3" 
WHERE IdAlumno IN (SELECT IdAlumno
                   FROM Calificaciones
                   WHERE Calificacion = 10 AND Materia = "Sql");

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
2 rows affected.
1 rows affected.
2 rows affected.

[]

In [11]:
%%sql
SELECT *
FROM alumnos

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
5 rows affected.

[(7, 'Monica', 'Hernandez', 'Esp_1'),
 (8, 'Jose', 'Hernandez', 'Esp_3'),
 (9, 'Carlos', 'Juarez', 'Esp_2'),
 (10, 'Raul', 'Juarez', 'Esp_1'),
 (11, 'Jairo', 'Lira', 'Esp_3')]

5. Cambia el nombre de la tabla creada

In [12]:
%%sql
ALTER TABLE alumnos RENAME students;

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
(pymysql.err.OperationalError) (1050, "Table 'students' already exists")
[SQL: ALTER TABLE alumnos RENAME students;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

6. Genera una vista con la información más relevante

In [13]:
%%sql 
CREATE VIEW relevant_view AS 
SELECT IdAlumno, Especializacion
FROM students;

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
(pymysql.err.OperationalError) (1050, "Table 'relevant_view' already exists")
[SQL: CREATE VIEW relevant_view AS
SELECT IdAlumno, Especializacion
FROM students;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [14]:
%%sql
SELECT *
FROM relevant_view

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
2 rows affected.

[(7, 'Esp_1'), (11, 'Esp_3')]

7. Elimina 3 registros de la tabla

In [15]:
%%sql
DELETE FROM students WHERE IdAlumno IN (8,9,10)

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
0 rows affected.

[]

In [16]:
%%sql
SELECT *
FROM students

 * mysql+pymysql://root:***@127.0.0.1:3306/new_schema
2 rows affected.

[(7, 'Monica', 'Hernandez', 'Esp_1'), (11, 'Jairo', 'Lira', 'Esp_3')]